input_openfoam/tutorials/lagrangian/reactingParcelFoam/filter/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

filter1
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        filter;

        type            DarcyForchheimer;

        d   (500000 -1000 -1000);
        f   (0 0 0);

        coordinateSystem
        {
            origin  (0 0 0);
            e1      (1 0 0);
            e2      (0 1 0);
        }
    }
}


massSource1
{
    type            scalarSemiImplicitSource;

    timeStart       0.2;
    duration        2.0;
    selectionMode   points;
    points
    (
        (2.75 0.5 0)
    );

    volumeMode      absolute;
    injectionRateSuSp
    {
        rho         (1e-4 0); // kg/s
        H2O         (1e-4 0); // kg/s
    }
}


momentumSource1
{
    type            vectorSemiImplicitSource;

    timeStart       0.2;
    duration        2.0;
    selectionMode   points;
    points
    (
        (2.75 0.5 0)
    );

    volumeMode      absolute;
    injectionRateSuSp
    {
        U           ((0 0.005 0) 0);
    }
}


energySource1
{
    type            scalarSemiImplicitSource;

    timeStart       0.2;
    duration        2.0;
    selectionMode   points;
    points
    (
        (2.75 0.5 0)
    );

    volumeMode      absolute;
    injectionRateSuSp
    {
        h           (10 0);
    }
}


// ************************************************************************* //
